; Localization

; ## SOLDIER CLASS

[ReconSoldierClass X2SoldierClassTemplate]
+DisplayName="Recon Operator"
+ClassSummary="The Recon Operator is specialized in reconnaisance tactics and stealth as well as in marksmanship. They provide eyes for the squad and can also support the squad with their advanced marksman skills."
+LeftAbilityTreeTitle="Recon Sniper"
+RightAbilityTreeTitle="Force Recon"



; ## NICKNAMES

+RandomNickNames[0]="Ghost"
+RandomNickNames[1]="Dagger"
+RandomNickNames[2]="Arrow"
+RandomNickNames[3]="Skulls"
+RandomNickNames[4]="Reaper"
+RandomNickNames[5]="Hammer"
+RandomNickNames[6]="Sickle"
+RandomNickNames[7]="Lead"
+RandomNickNames[8]="Gunny"
+RandomNickNames[9]="Highway"
+RandomNickNames[10]="Stitch"
+RandomNickNames[11]="Swede"
+RandomNickNames[12]="Sweeper"
+RandomNickNames[13]="Eagle Eye"
+RandomNickNames[14]="Wolf"
+RandomNickNames[15]="Wolverine"
+RandomNickNames[16]="Jaguar"
+RandomNickNames[17]="Cowboy"




; ## ABILITIES
; # General abilities

[ReconSquaddie X2AbilityTemplate]
+LocFriendlyName="Recon Operator"
+LocLongDescription="Well trained in reconnaissance and tactics. Grants Light Feet, Phantom and Fire Pistol."
+LocHelpText="Well trained in reconnaissance and tactics. Grants Light Feet, Phantom and Fire Pistol."
+LocPromotionPopupText="<Bullet/> Well trained in reconnaissance and tactics. Grants Light Feet, Phantom and Fire Pistol"

[ReconLightFeet X2AbilityTemplate]
+LocFriendlyName="Light Feet"
+LocLongDescription="Gains +3 mobility and a 20% smaller detection radius."
+LocHelpText="+3 mobility, 20% reduced detection radius."
+LocFlyOverText="Light Feet"
+LocPromotionPopupText="<Bullet/> +3 Mobility<br/><Bullet/> Lower detection radius<br/><Bullet/> Passive skill<br/>"

; ### GTS ABILITY

[ReconAdrenalineSpike X2AbilityTemplate]
+LocFriendlyName="Adrenaline Rush"
+LocLongDescription="The soldier has a 50% chance of getting an adrenaline rush when taking damage, granting an extra action point on player's next turn."
+LocHelpText="50% chance of gaining an extra action point when hit."
+LocFlyOverText="Adrenaline Rush"
+LocPromotionPopupText="<Bullet/> The soldier has a 50% chance of getting an adrenaline rush when taking damage, granting an extra action point on player's next turn."

; Stealth: default ability
; Pistol: default ability


; # Recon Sniper abilities

; The ability doesn't really grant squadsight, it's the weapon's ability that does that. This is just for the information text.
[ReconMarksmanSpecialization X2AbilityTemplate]
+LocFriendlyName="Marksman"
+LocLongDescription="Removes the moving penalty from the Marksman Rifle and enables Squadsight for the Marksman Rifle."
+LocHelpText="Removes the moving penalty from the Marksman Rifle and enables Squadsight for the Marksman Rifle."
+LocFlyOverText="Marksman"
+LocPromotionPopupText="<Bullet/> Removes the moving penalty from the Marksman Rifle<br/><Bullet/> Grants squadsight when using the Marksman Rifle<br/><Bullet/> Passive skill"

[ReconMarkTargets X2AbilityTemplate]
+LocFriendlyName="Reconnoiter"
+LocLongDescription="All enemies in a small cone get reconnoitered for an accuracy and critical hit chance bonus for the whole squad, does not reveal the operator. 3 turn cooldown."
+LocHelpText="Marks targets in a small cone for squad, does not reveal the operator. 3 turn cooldown."
+LocFlyOverText="Reconnoiter"
+LocPromotionPopupText="<Bullet/> Gains the ability to reconnoiter targets in a small cone for an accuracy and critical hit chance bonus for the whole squad<br/><Bullet/> Does not reveal the operator<br/><Bullet/> 3 turn cooldown"

[ReconConcealedShot X2AbilityTemplate]
+LocFriendlyName="Concealed Shot"
+LocLongDescription="Allows firing a shot without revealing the operator. 3 turn cooldown."
+LocHelpText="Allows firing a shot without revealing the operator. 3 turn cooldown."
+LocFlyOverText="Concealed Shot"
+LocPromotionPopupText="<Bullet/> Gains the ability to fire a shot without revealing the operator<br/><Bullet/> 3 turn cooldown<br/>"

[ReconDoubleShot X2AbilityTemplate]
+LocFriendlyName="Double Shot"
+LocLongDescription="Fires two shots at the same target, with the second shot incurring a 15% accuracy penalty. 4 turn cooldown."
+LocHelpText="Fires two shots at the same target, with the second shot incurring a 15% accuracy penalty. 4 turn cooldown."
+LocFlyOverText="Double Shot"
+LocPromotionPopupText="<Bullet/> Gains the ability to fire twice at the same target, with the second shot incurring a 15% accuracy penalty<br/><Bullet/> 4 turn cooldown<br/>"

[ReconDoubleShot2 X2AbilityTemplate]
+LocFriendlyName="Double Shot"
+LocFlyOverText="Double Shot"
+LocPromotionPopupText=""

[ReconPinpointAccuracyShot X2AbilityTemplate]
+LocFriendlyName="Pinpoint Accuracy"
+LocLongDescription="Allows firing a shot that ignores 50% of the high/low cover defense bonus. 4 turn cooldown."
+LocHelpText="Allows firing a shot that ignores 50% of the high/low cover defense bonus. 4 turn cooldown."
+LocFlyOverText="Pinpoint Accuracy"
+LocPromotionPopupText="<Bullet/> Allows firing a shot that ignores 50% of the high/low cover defense bonus<br/><Bullet/> 4 turn cooldown<br/>"

[ReconExtremePrejudice X2AbilityTemplate]
+LocFriendlyName="Extreme Prejudice"
+LocLongDescription="Enhanced overwatch. The operator applies all its skill to fire as many rounds to its targets as fast as possible, enabling it to fire multiple rounds at a single or multiple targets, emptying the clip. Each consecutive shot incurs an 7% accuracy penalty. Can be activated from Concealment (breaks concealment when firing). Marksman Rifle squadsight applies. 5 turn cooldown."
+LocHelpText="Enhanced overwatch, empties the clip firing at overwatch targets. Each consecutive shot gets a 5% accuracy penalty."
+LocFlyOverText="Extreme Prejudice"
+LocPromotionPopupText="<Bullet/> Enhanced overwatch. The operator applies all its skill to fire as many rounds to its targets as fast as possible, enabling it to fire multiple rounds at a single or multiple targets, emptying the clip<br/><Bullet/> Each consecutive shot incurs an 7% accuracy penalty<br/><Bullet/>  Can be activated from Concealment (breaks concealment when firing)<br/><Bullet/> Marksman Rifle squadsight applies<br/><Bullet/> 5 turn cooldown"

[ReconExtremePrejudiceOverwatchShot X2AbilityTemplate]
+LocFriendlyName="Extreme Prejudice"
+LocFlyOverText="Extreme Prejudice"

; # Force Recon abilities

[ReconSituationalAwareness X2AbilityTemplate]
+LocFriendlyName="Situational Awareness"
+LocLongDescription="If an enemy spawn is triggered by this operator's movement, a free immediate reaction fire is granted with the primary weapon, once per turn. Passive skill."
+LocHelpText="Grants immediate reaction fire if a spawn is triggered by the operator's movement."
+LocFlyOverText="Situational Awareness"
+LocPromotionPopupText="<Bullet/> If an enemy spawn is triggered by this operator's movement, a free immediate reaction fire is granted with the primary weapon, once per turn<br/><Bullet/> Passive skill<br/>"

[ReconSituationalAwarenessReaction X2AbilityTemplate]
+LocFriendlyName="Situational Awareness"
+LocLongDescription="If an enemy spawn is triggered by this operator's movement, a free immediate reaction fire is granted with the primary weapon, once per turn. Passive skill."
+LocHelpText="Grants immediate reaction fire if a spawn is triggered by the operator's movement."
+LocFlyOverText="Situational Awareness"
+LocPromotionPopupText="<Bullet/> If an enemy spawn is triggered by this operator's movement, a free immediate reaction fire is granted with the primary weapon, once per turn<br/><Bullet/> Passive skill<br/>"


[ReconSpeculativeFire X2AbilityTemplate]
+LocFriendlyName="Speculative Fire"
+LocLongDescription="Fire at suspected enemy positions to trigger an enemy spawn. Can fire through obstacles if Armor Piercing Ammo is equipped. 4 turn cooldown."
+LocHelpText="Fire at suspected enemy positions to trigger an enemy spawn. AP ammo allows firing through obstacles."
+LocFlyOverText="Situational Awareness"
+LocPromotionPopupText="<Bullet/> Fire at suspected enemy positions to trigger an enemy spawn<br/><Bullet/> Can fire through obstacles if Armor Piercing Ammo is equipped<br/><Bullet/> 4 turn cooldown"

[ReconShooter X2AbilityTemplate]
+LocFriendlyName="Rifleman"
+LocLongDescription="Standard Shot no longer ends the turn."
+LocHelpText="Standard Shot no longer ends the turn."
+LocFlyOverText="Rifleman"
+LocPromotionPopupText="<Bullet/> Standard Shot no longer ends the turn<br/><Bullet/> Passive skill<br/>"

[ReconBringEmOn X2AbilityTemplate]
+LocFriendlyName="Fighting Spirit"
+LocLongDescription="Grants a base crit chance of 10% and +1 extra weapon damage per two enemies in sight, doubled on critical hits. Passive skill."
+LocHelpText="Grants a base crit chance of 10% and +1 extra weapon damage per two enemies in sight, doubled on critical hits."
+LocFlyOverText="Fighting Spirit"
+LocPromotionPopupText="<Bullet/> Grants a base crit chance of 10% and +1 extra weapon damage per two enemies in sight, doubled on critical hits.<br/><Bullet/> Passive skill<br/>"

[ReconReturnFire X2AbilityTemplate]
+LocFriendlyName="Return Fire"
+LocLongDescription="Grants the operator the ability to return fire against up to 3 attacks on the enemy's next turn. If the operator gets hit while the ability is active the operator automatically hunkers down for more cover. Free activation. 3 turn cooldown."
+LocHelpText="Grants the operator return fire. Hunkers down if hit. Free activation. 3 turn cooldown."
+LocFlyOverText="Return Fire"
+LocPromotionPopupText="<Bullet/> Grants the operator the ability to return fire against up to 3 attacks on the enemy's next turn<br/><Bullet/> If the operator gets hit while the ability is active the operator automatically hunkers down for more cover<br/><Bullet/> Free activation<br/><Bullet/> 3 turn cooldown<br/>"

[ReconStandardReturnFire X2AbilityTemplate]
+LocFlyOverText="Return Fire"

[ReconSurvivor X2AbilityTemplate]
+LocFriendlyName="Survivor"
+LocLongDescription="Grants the operator improvised armor plating, adding 1 point of armor. Also grants the operator the ability to administer emergency first aid to self heal, healing 4hp. The first aid also removes fire, acid and poison effects. Can be used once per mission."
+LocHelpText="Grants the operator 1 armor, and self first aid ability, healing 4hp."
+LocFlyOverText="Survivor"
+LocPromotionPopupText="<Bullet/> Grants the operator improvised armor plating, adding 1 point of armor<br/><Bullet/> Grants the operator the ability to administer emergency first aid to self heal once per mission, healing 4hp. The first aid also removes fire, acid and poison effects.<br/><Bullet/> Can be used once per mission"

[ReconSurvivorAidKit X2AbilityTemplate]
+LocFriendlyName="First Aid"
+LocHelpText="Heals the aid kit owner for 4hp. Removes poison, acid and fire effects."
+LocFlyOverText="First Aid"



; ## CARBINE WEAPON

[ReconCarbine_CV X2WeaponTemplate]
FriendlyName="Carbine"
FriendlyNamePlural="Carbines"
BriefSummary="The Carbine is a shorter and lighter variant of the Assault Rifle."
TacticalText="<Bullet/> The Carbine is a shorter and lighter variant of the Assault Rifle. Its damage equals the rifle version but its accuracy at longer ranges is reduced. Accuracy at medium and short ranges is higher than with the Assault Rifle.<br/>"
AbilityDescName="Carbine"

[ReconCarbine_MG X2WeaponTemplate]
FriendlyName="Magnetic Carbine"
FriendlyNamePlural="Magnetic Carbines"
BriefSummary="The Magnetic Carbine is a shorter and lighter variant of the Magnetic Rifle."
TacticalText="<Bullet/> The Magnetic Carbine is a shorter and lighter variant of the Magnetic Rifle. Its damage equals the rifle version but its accuracy at longer ranges is reduced. Accuracy at medium and short ranges is higher than with the Magnetic Rifle.<br/>"
AbilityDescName="Magnetic Carbine"

[ReconCarbine_BM X2WeaponTemplate]
FriendlyName="Beam Carbine"
FriendlyNamePlural="Beam Carbines"
BriefSummary="The Beam Carbine is a shorter and lighter variant of the Beam Rifle."
TacticalText="<Bullet/> The Beam Carbine is a shorter and lighter variant of the Beam Rifle. Its damage equals the rifle version but its accuracy at longer ranges is reduced. Accuracy at medium and short ranges is higher than with the Beam Rifle.<br/>"
AbilityDescName="Beam Carbine"

; # CARBINE GRANTED ABILITIES

[ReconCarbineStatBonus X2AbilityTemplate]
+LocFriendlyName="Lightweight Carbine"
+LocLongDescription="The lightweight weapon grants a +1 movement bonus."
+LocHelpText="The lightweight weapon grants a +1 movement bonus."





; ## MARKSMAN RIFLE WEAPON

[ReconMarksmanRifle_CV X2WeaponTemplate]
FriendlyName="Marksman Rifle"
FriendlyNamePlural="Marksman Rifles"
BriefSummary="The Marksman Rifle is a hybrid between the Sniper Rifle and the Assault Rifle."
TacticalText="<Bullet/> The Marksman Rifle is a hybrid between the Sniper Rifle and the Assault Rifle.<br/><Bullet/> Its damage equals the Assault Rifle but it has a higher base chance to cause critical hits<br/><Bullet/> A penalty is applied to accuracy if the soldier moves before firing<br/><Bullet/> For specialized Marksmen, grants Squadsight and the movement penalty is removed<br/><Bullet/> A -10% accuracy penalty applies to targets at Squadsight range"
AbilityDescName="Marksman Rifle"

[ReconMarksmanRifle_MG X2WeaponTemplate]
FriendlyName="Magnetic Marksman Rifle"
FriendlyNamePlural="Marksman Rifles"
BriefSummary="The Marksman Rifle is a hybrid between the Sniper Rifle and the Assault Rifle."
TacticalText="<Bullet/> The Marksman Rifle is a hybrid between the Sniper Rifle and the Assault Rifle.<br/><Bullet/> Its damage equals the Assault Rifle but it has a higher base chance to cause critical hits<br/><Bullet/> A penalty is applied to accuracy if the soldier moves before firing<br/><Bullet/> For specialized Marksmen, grants Squadsight and the movement penalty is removed<br/><Bullet/> A -10% accuracy penalty applies to targets at Squadsight range"
AbilityDescName="Magnetic Marksman Rifle"

[ReconMarksmanRifle_BM X2WeaponTemplate]
FriendlyName="Beam Marksman Rifle"
FriendlyNamePlural="Marksman Rifles"
BriefSummary="The Marksman Rifle is a hybrid between the Sniper Rifle and the Assault Rifle."
TacticalText="<Bullet/> The Marksman Rifle is a hybrid between the Sniper Rifle and the Assault Rifle.<br/><Bullet/> Its damage equals the Assault Rifle but it has a higher base chance to cause critical hits<br/><Bullet/> A penalty is applied to accuracy if the soldier moves before firing<br/><Bullet/> For specialized Marksmen, grants Squadsight and the movement penalty is removed<br/><Bullet/> A -10% accuracy penalty applies to targets at Squadsight range"
AbilityDescName="Beam Marksman Rifle"


; # MARKSMAN RIFLE GRANTED ABILITIES

[ReconMarksmanRifleBonus X2AbilityTemplate]
+LocFriendlyName="Marksman Rifle Squadsight"
+LocLongDescription="The Marksman Rifle provides Squadsight ability to this soldier."
+LocHelpText="The Marksman Rifle provides Squadsight ability to this soldier."

[ReconMarksmanMovementEffects X2AbilityTemplate]
+LocFriendlyName="Marksman Rifle Movement Penalty"
+LocLongDescription="The soldier is equipped with the Marksman Rifle and has moved on this turn, causing an accuracy penalty."
+LocHelpText="The soldier is equipped with the Marksman Rifle and has moved on this turn, causing an accuracy penalty."




[ReconAdrenalineUnlock X2SoldierAbilityUnlockTemplate]
DisplayName="Recon: Adrenaline Rush"
Summary="50% chance to gain an additional action point on the next turn when the soldier takes damage."
